Revit 2024 API
FamilySizeTableColumn Members
The FamilySizeTableColumn type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the FamilySizeTableColumn
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetSpecTypeId
 Gets the identifier of the spec describing values in the column.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
GetUnitTypeId
 Gets the identifier of the unit quantifying values in the column.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Name
 The column name.
See Also
FamilySizeTableColumn Class
Autodesk.Revit.DB Namespace